{
  "greeting": "Hello",
  "description": "Welcome to our website",
  "languages": {
    "changeLanguage": "Change Language",
    "english": "English",
    "french": "French"
  },
  "portfolio": {
    "userDataFetchFail": "Something went wrong when trying to pull your articles..",
    "email": "Email",
    "tryAgain": "Please try again..",
    "portfolio": "Portfolio",
    "call": "Call",
    "emailing": "Emailing"
  },
  "articleItem": {
    "explore": "Explore",
    "summary": "Summary",
    "previous": "Previous",
    "next": "Next"
  },
  "about": {
    "vision": "Vision",
    "problem": "The Problem",
    "problemText": "Staying up to date with tech is overwhelming. Resources are scattered, and platforms like YouTube flood users with outdated or irrelevant tutorials. The Digital Vanguard (TDV) solves this by organizing everything into a single ecosystem, ranking content through an AI-powered system that prioritizes value—keeping information current, relevant, and widely applicable.",
    "how": "How 'The Digital Vanguard' works",
    "howText": "Users can sign up as developers or consumers. Developers tag their interests (React, Full Stack, Blockchain, etc.) and gain a personalized experience. Consumers can browse, search topics, or follow specific developers. TDV acts as a living portfolio. Instead of fragmented personal blogs and portfolios, developers get a unified profile (e.g., thedigitalvanguard.io/johndoe), linking all their articles, thoughts, and projects in one place. This fosters a strong,exclusive community—being part of the Vanguard.",
    "consumers": "For Consumers",
    "consumersText": "TDV blends elements of GitHub, Reddit, and Medium. Users can explore topics like “Full Stack” or “FinTech” and discover top-ranked developers based on engagement (likes, shares, and ‘helpful’ feedback). The more a developer contributes, the higher they rank.",
    "tracking": "Project Tracking & Portfolio Building",
    "trackingText": "TDV provides structured project tracking. Instead of abandoning ideas after brief experimentation, developers create entities—structured project pages with: • A name & tech tags • A markdown editor for progress tracking • A place to link the finished project (e.g., a hosted site or demo video) TDV even guides users in deploying projects at the lowest cost, ensuring work isn’t lost but becomes a shareable portfolio piece.",
    "medium": "Why not just use something like Medium?",
    "mediumText": "Medium is broad and unfocused—anyone can write about anything. TDV is developer-centric. An AI/ML review board ensures content remains tech-focused, filtering out unrelated topics. TDV isn’t just a blog platform; it’s a structured space for passionate tech professionals to track progress, build portfolios, and stay ahead in their field."
  }
}
